/*
 Navicat Premium Data Transfer

 Source Server         : 172.16.7.110
 Source Server Type    : MySQL
 Source Server Version : 50173
 Source Host           : localhost
 Source Database       : koalamall

 Target Server Type    : MySQL
 Target Server Version : 50173
 File Encoding         : utf-8

 Date: 03/06/2015 13:39:10 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `mbiz_chat_history`
-- ----------------------------
DROP TABLE IF EXISTS `cr_chat_history`;
CREATE TABLE `cr_chat_history` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `room_id` int(11) DEFAULT NULL COMMENT '房间id',
  `msg_content` text COMMENT '内容',
  `msg_type` int(11) DEFAULT NULL COMMENT '消息类型',
  `send_user` varchar(255) DEFAULT NULL COMMENT '发送人',
  `recipient_user` varchar(255) DEFAULT NULL,
  `create_time` int(20) DEFAULT NULL,
  `s_id` varchar(255) DEFAULT NULL COMMENT '当前会话ID',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=58 DEFAULT CHARSET=utf8 COMMENT='聊天室消息记录;';

-- ----------------------------
--  Records of `mbiz_chat_history`
-- ----------------------------
BEGIN;
INSERT INTO `cr_chat_history` VALUES ('1', '1', 'asfsa', '1', '匿名', 'all', '1425536809', '{2a80be2b-e716-6d11-e9a3-9aaa5af86ab3}'), ('2', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425536832', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('3', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425536837', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('4', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425536850', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('5', '1', 'fjhgfh', '1', '匿名', 'all', '1425536879', '{2a80be2b-e716-6d11-e9a3-9aaa5af86ab3}'), ('6', '1', '有点意思', '1', '匿名', 'all', '1425536885', '{2a80be2b-e716-6d11-e9a3-9aaa5af86ab3}'), ('7', '1', '12312', '1', '匿名', 'all', '1425536935', '{238959e5-b094-475d-e33f-d3fe98cc2283}'), ('8', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425536942', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('9', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425536948', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('10', '1', 'test', '1', '匿名', 'all', '1425537065', '{a176d74d-60de-662a-1e53-9d94692e9a57}'), ('11', '1', '123123', '1', '匿名', 'all', '1425537075', '{a176d74d-60de-662a-1e53-9d94692e9a57}'), ('12', '1', '123123', '1', '匿名', 'all', '1425537076', '{a176d74d-60de-662a-1e53-9d94692e9a57}'), ('13', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425537081', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('14', '1', '先用着..', '1', '匿名', 'all', '1425537100', '{238959e5-b094-475d-e33f-d3fe98cc2283}'), ('15', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425537112', '{ed1542b3-6d22-629a-dcb6-29be6a2ee3d3}'), ('16', '1', 'test', '1', '匿名', 'all', '1425537136', '{a176d74d-60de-662a-1e53-9d94692e9a57}'), ('17', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425537141', '{529a9555-f027-7cbc-9327-444c06ba94a0}'), ('18', '1', 'ooook', '1', '匿名', 'all', '1425537152', '{a176d74d-60de-662a-1e53-9d94692e9a57}'), ('19', '1', '111', '1', '匿名', 'all', '1425537193', '{394452d2-2811-25a7-70f8-87b198d7e79d}'), ('20', '1', '2222', '1', '匿名', 'all', '1425537227', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('21', '1', '3333', '1', '匿名', 'all', '1425537229', '{394452d2-2811-25a7-70f8-87b198d7e79d}'), ('22', '1', '就是这么回事; 因为是写库操作; 所以人太多的话, 会卡死;', '1', '匿名', 'all', '1425537286', '{0c6c7efd-36d1-b50c-3775-a2c36e653a33}'), ('23', '1', '聊天测试', '1', '匿名', 'all', '1425537304', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('24', '1', '呼叫 LeMPhone 进来了吗？', '1', '匿名', 'all', '1425537343', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('25', '1', '进来了', '1', '匿名', 'all', '1425537476', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('26', '1', '没有用户名', '1', '匿名', 'all', '1425537491', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('27', '1', '现在电脑这边 可以发送聊天信息 手机可以查看 并点赞', '1', '匿名', 'all', '1425537500', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('28', '1', '需要有用户名', '1', '匿名', 'all', '1425537503', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('29', '1', '好的', '1', '匿名', 'all', '1425537508', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('30', '1', '用户名可以指定', '1', '匿名', 'all', '1425537519', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('31', '1', '今天把用户名加上', '1', '匿名', 'all', '1425537519', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('32', '1', '是有点卡', '1', '匿名', 'all', '1425537544', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('33', '1', '可以多个人同时发言吗', '1', '匿名', 'all', '1425537559', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('34', '1', '可以啊', '1', '匿名', 'all', '1425537566', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('35', '1', '现在完成了聊天室的内核', '1', '匿名', 'all', '1425537576', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('36', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425537585', '{21f53ec6-5bbf-eea9-896e-7c8059036b20}'), ('37', '1', '你再开个浏览器', '1', '匿名', 'all', '1425537590', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('38', '1', '点赞 的话，能出一个数字吗', '1', '匿名', 'all', '1425537604', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('39', '1', '不是出现一堆赞', '1', '匿名', 'all', '1425537614', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('40', '1', '恩 这个字样 要写什么？', '1', '匿名', 'all', '1425537623', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('41', '1', '而是显示一个数字，赞的个数', '1', '匿名', 'all', '1425537624', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('42', '1', '就是  赞 100', '1', '匿名', 'all', '1425537632', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('43', '1', '哦 好的', '1', '匿名', 'all', '1425537632', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('44', '1', '然后用户数据可以得到的吧', '1', '匿名', 'all', '1425537643', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('45', '1', '你说下 想要获得什么样的数据', '1', '匿名', 'all', '1425537658', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('46', '1', '在线的用户数', '1', '匿名', 'all', '1425537702', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('47', '1', '恩 好的', '1', '匿名', 'all', '1425537710', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('48', '1', '总共有多少用户浏览过', '1', '匿名', 'all', '1425537720', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('49', '1', '用户停留时间', '1', '匿名', 'all', '1425537727', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('50', '1', 'OK', '1', '匿名', 'all', '1425537746', '{0c712a74-d53f-e436-dd8c-cfe85db03f54}'), ('51', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425537932', '{d4709839-7dbf-315e-a3d2-b74545a31b16}'), ('52', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425538248', '{a1a57cb9-99e7-db69-c529-21c365f21c27}'), ('53', '1', '手机页面看到的画面和字体小', '1', '匿名', 'all', '1425538487', '{02fef424-2df0-1b82-4edb-94f0f38559ac}'), ('54', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425539490', '{fb9f81a5-7e35-f2ef-3995-03dee241502e}'), ('55', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425539494', '{fb9f81a5-7e35-f2ef-3995-03dee241502e}'), ('56', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425547084', null), ('57', '1', '赞赞赞赞赞赞赞赞赞赞赞赞赞赞!', '2', '匿名', 'all', '1425548735', '{a73545bf-fac7-8de8-604b-57402b84a05f}');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
